The length of the duct. Units: (ft).
  Namespace:   Autodesk.Revit.DB.Mechanical
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public double Length { get; }
  Visual Basic
Public ReadOnly Property Length As Double
	Get
  Visual C++
public:
property double Length {
	double get ();
}
 See Also
  DuctPressureDropData Class
  Autodesk.Revit.DB.Mechanical Namespace